## **TP1**

RÉALISER PAR: HADDAD SOUHA


---

In [16]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

**Importer les bibliothèques numpy et pandas et importer functools de reduce**

In [17]:
# Importer les bibliothèques nécessaires
import pandas as pd
import numpy as np

# PART 1 : 
### **1 Exploration du datase**

Explorer la dataset BL-Flickr-Images-Book.csv

In [18]:
# Exporter BL-Flickr-Images-Book.csv dans un data frame nomé df
df = pd.read_csv("https://raw.githubusercontent.com/nevermind78/DM/master/TP1/Datasets/BL-Flickr-Images-Book.csv")
# Afficher les 5 premières lignes
df.head()

   Identifier  ...                           Shelfmarks
0         206  ...    British Library HMNTS 12641.b.30.
1         216  ...    British Library HMNTS 12626.cc.2.
2         218  ...    British Library HMNTS 12625.dd.1.
3         472  ...  British Library HMNTS 10369.bbb.15.
4         480  ...     British Library HMNTS 9007.d.28.

[5 rows x 15 columns]

### **2 Jeter un coup d'oeil dans le dataset**

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8287 entries, 206 to 4160339
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Place of Publication  8287 non-null   object
 1   Date of Publication   8287 non-null   object
 2   Publisher             4092 non-null   object
 3   Title                 8287 non-null   object
 4   Author                8287 non-null   object
 5   Flickr URL            8287 non-null   object
dtypes: object(6)
memory usage: 453.2+ KB

### **3 Qu'est ce que vous remarquez?**

### **4 Dropping unnecessary columns**

Nous allons restreindre l'étude à seulement 7 colomnes pour cela nous allons supprimer 7 colonnes que nous jugeons unitiles por le moment :

In [20]:
to_drop = ['Edition Statement',
           'Corporate Author',
           'Corporate Contributors',
           'Former owner',
           'Engraver',
           'Contributors',
           'Issuance type',
           'Shelfmarks']
#Eliminer les colonnes dans la liste de to_drop du dataframe df
df.drop(to_drop, inplace = True, axis = 1)
#Afficherle résultat
df.head()

   Identifier  ...                                         Flickr URL
0         206  ...  http://www.flickr.com/photos/britishlibrary/ta...
1         216  ...  http://www.flickr.com/photos/britishlibrary/ta...
2         218  ...  http://www.flickr.com/photos/britishlibrary/ta...
3         472  ...  http://www.flickr.com/photos/britishlibrary/ta...
4         480  ...  http://www.flickr.com/photos/britishlibrary/ta...

[5 rows x 7 columns]

### **5 Setting the index of the dataset**

Changer l'index pourqu'ille prenne la valeur de l'identifiant Identifier

In [44]:
###Changerl'index 
df.set_index('Identifier', inplace = True)

###Afficher le résultat
df.head()

KeyError: ignored

### **6 Donner un appérçu sur la colonne Date of Publication**

In [35]:
### Afficher  les 25 premières valeurs de Date of Publication
df['Date of Publication'].head(25)

Identifier
206     1879
216      1868
218      1869
472      1851
480      1857
481      1875
519      1872
667       NaN
874      1676
1143     1679
1280     1802
1808     1859
1905     1888
1929     1839
2836     1897
2854     1865
2956     1860
2957     1873
3017     1866
3131     1899
4598     1814
4884     1820
4976     1800
5382     1847
5385      NaN
Name: Date of Publication, dtype: object

### **7 Cleaning columns using the .apply function**

Ecrire une fonction qui permet de nettoyer la colonne des dates

In [36]:
unwanted_characters = ['[', ',', '-']

def clean_dates(item):
    dop= str(item.loc['Date of Publication'])
    
    if dop == 'nan' or dop[0] == '[':
        return np.NaN
    
    for character in unwanted_characters:
        if character in dop:
            character_index = dop.find(character)
            dop = dop[:character_index]
    
    return dop

df['Date of Publication'] = df.apply(clean_dates, axis = 1)

In [37]:
### Afficher  les 5 premières valeurs 
df.head()

                Place of Publication  ...                                         Flickr URL
Identifier                            ...
206                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...
216         London; Virtue & Yorston  ...  http://www.flickr.com/photos/britishlibrary/ta...
218                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...
472                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...
480                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...

[5 rows x 6 columns]

In [38]:
#Voici une autre méthode
#exécuter pour voir le résultat
unwanted_characters = ['[', ',', '-']

def clean_dates(dop):
    dop = str(dop)
    if dop.startswith('[') or dop == 'nan':
        return 'NaN'
    for character in unwanted_characters:
        if character in dop:
            character_index = dop.find(character)
            dop = dop[:character_index]
    return dop

df['Date of Publication'] = df['Date of Publication'].apply(clean_dates)
df.head(10)

                           Place of Publication  ...                                         Flickr URL
Identifier                                       ...
206                                      London  ...  http://www.flickr.com/photos/britishlibrary/ta...
216                    London; Virtue & Yorston  ...  http://www.flickr.com/photos/britishlibrary/ta...
218                                      London  ...  http://www.flickr.com/photos/britishlibrary/ta...
472                                      London  ...  http://www.flickr.com/photos/britishlibrary/ta...
480                                      London  ...  http://www.flickr.com/photos/britishlibrary/ta...
481                                      London  ...  http://www.flickr.com/photos/britishlibrary/ta...
519                                      London  ...  http://www.flickr.com/photos/britishlibrary/ta...
667         pp. 40. G. Bryan & Co: Oxford, 1898  ...  http://www.flickr.com/photos/britishlibrary/ta...
874                                     London]  ...  http://www.flickr.com/photos/britishlibrary/ta...
1143                                     London  ...  http://www.flickr.com/photos/britishlibrary/ta...

[10 rows x 6 columns]

### **8 Observer la collone Author**

Completer la fonction clean_author_namesqui permet de corriger les valeurs de cet colonne

In [45]:
from functools import reduce

In [46]:
def clean_author_names(author):
    
    author = str(author)
    
    if author == 'nan':
        return 'NaN'
    
    author = author.split(',')

    if len(author) == 1:
        name = filter(lambda x: x.isalpha(), author[0])
        return reduce(lambda x, y: x + y, name)
    
    last_name, first_name = author[0], author[1]

    first_name = first_name[:first_name.find('-')] if '-' in first_name else first_name
    
    if first_name.endswith(('.', '.|')):
        parts = first_name.split('.')
        
        if len(parts) > 1:
            first_occurence = first_name.find('.')
            final_occurence = first_name.find('.', first_occurence + 1)
            first_name = first_name[:final_occurence]
        else:
            first_name = first_name[:first_name.find('.')]
    
    last_name = last_name.capitalize()
    
    return f'{first_name} {last_name}'


df['Author'] = df['Author'].apply(clean_author_names)

### **RESULTAT ATTENDU**

In [41]:
df.head()

                Place of Publication  ...                                         Flickr URL
Identifier                            ...
206                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...
216         London; Virtue & Yorston  ...  http://www.flickr.com/photos/britishlibrary/ta...
218                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...
472                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...
480                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...

[5 rows x 6 columns]

### **9 Completer la fonction clean_titlequi permet de corriger les valeurs de la colone Title**

In [42]:
## complétrer la fonction suivante ( à la place de pass)
def clean_title(title):
    
    if title == 'nan':
        return 'NaN'
    
    if title[0] == '[':
        title = title[1: title.find(']')]
        
    if 'by' in title:
        title = title[:title.find('by')]
    elif 'By' in title:
        title = title[:title.find('By')]
        
    if '[' in title:
        title = title[:title.find('[')]

    title = title[:-2]
        
    title = list(map(str.capitalize, title.split()))
    return ' '.join(title)
    
df['Title'] = df['Title'].apply(clean_title)

IndexError: ignored

### **RESULTAT ATTENDU**

In [30]:
df.head()

                Place of Publication  ...                                         Flickr URL
Identifier                            ...
206                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...
216         London; Virtue & Yorston  ...  http://www.flickr.com/photos/britishlibrary/ta...
218                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...
472                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...
480                           London  ...  http://www.flickr.com/photos/britishlibrary/ta...

[5 rows x 6 columns]

# PART 2 : 
### **1 Cleaning entire dataset**

In [47]:
from google.colab import drive

In [49]:
drive.mount('/drive')

Mounted at /drive

In [48]:
with open('/drive/MyDrive/Colab Notebooks/Datasets/university_towns.txt', 'r') as text:
    textfile = text.read()
    print(textfile)

OSError: ignored

### 2 Créer un pandas data frame à partir d'un fichier txt

On veut créer un DataFrame nommé towns_df à partir du fichier 'university_towns.txt'

Nous voyons que nous avons des noms d'états périodiques suivis des villes universitaires de cet état: StateA TownA1 TownA2 StateB TownB1 TownB2 .... Si nous regardons la façon dont les noms d'états sont écrits dans le fichier, nous verrons qu'ils ont tous la sous-chaîne «[edit]» en eux.

Nous pouvons tirer parti de ce modèle en créant une liste de tuples (état, ville) et en enveloppant cette liste dans un DataFrame:

In [50]:
university_towns = []

with open('/drive/MyDrive/Colab Notebooks/Datasets/university_towns.txt', 'r') as file:
    items = file.readlines()
    states = list(filter(lambda x: '[edit]' in x, items))
    
    for index, state in enumerate(states):
        start = items.index(state) + 1
        if index == 49: #since 50 states
            end = len(items)
        else:
            end = items.index(states[index + 1])
            
        pairs = map(lambda x: [state, x], items[start:end])
        university_towns.extend(pairs)
        
towns_df = pd.DataFrame(university_towns, columns = ['State', 'RegionName'])
towns_df.head()

             State                                         RegionName
0  Alabama[edit]\n                    Auburn (Auburn University)[1]\n
1  Alabama[edit]\n           Florence (University of North Alabama)\n
2  Alabama[edit]\n  Jacksonville (Jacksonville State University)[2]\n
3  Alabama[edit]\n       Livingston (University of West Alabama)[2]\n
4  Alabama[edit]\n         Montevallo (University of Montevallo)[2]\n

In [51]:
towns_df = pd.DataFrame(university_towns,columns=['State', 'RegionName'])
towns_df.head()

             State                                         RegionName
0  Alabama[edit]\n                    Auburn (Auburn University)[1]\n
1  Alabama[edit]\n           Florence (University of North Alabama)\n
2  Alabama[edit]\n  Jacksonville (Jacksonville State University)[2]\n
3  Alabama[edit]\n       Livingston (University of West Alabama)[2]\n
4  Alabama[edit]\n         Montevallo (University of Montevallo)[2]\n

### 3 Compléter la fonction clean_up pour nettoyer les colonnes de towns_df

In [52]:
## complétrer la fonction suivante ( à la place de pass)
def clean_up(item):
    if '(' in item:
        return item[:item.find('(') - 1]
    
    if '[' in item:
        return item[:item.find('[')]
    

towns_df =  towns_df.applymap(clean_up)
towns_df.head()

     State    RegionName
0  Alabama        Auburn
1  Alabama      Florence
2  Alabama  Jacksonville
3  Alabama    Livingston
4  Alabama    Montevallo

# **PART III ( OPTIONNELLE)**

## **1 Renaming columns and skipping rows**

### **1.1 Convertir le fichier olympics.csv en dataframe pandas olympics_df**

In [55]:
# exporter 'olympics.csv' sous forme de data frame nommé olympics_df
olympics_df = pd.read_csv('/drive/MyDrive/Colab Notebooks/Datasets/olympics.csv')
# Afficher les 5 premières lignes
olympics_df.head()

                   0         1     2     3  ...    12    13    14              15
0                NaN  ? Summer  01 !  02 !  ...  01 !  02 !  03 !  Combined total
1  Afghanistan (AFG)        13     0     0  ...     0     0     2               2
2      Algeria (ALG)        12     5     2  ...     5     2     8              15
3    Argentina (ARG)        23    18    24  ...    18    24    28              70
4      Armenia (ARM)         5     1     2  ...     1     2     9              12

[5 rows x 16 columns]

### **1.2 Supprimer la première ligne**

In [56]:
# exporter 'olympics.csv' sous forme de data frame nommé olympics_df en supprimant la première ligne
olympics_df = pd.read_csv('/drive/MyDrive/Colab Notebooks/Datasets/olympics.csv', skiprows = 1, header = 0)
# Afficher les 5 premières lignes
olympics_df.head()

                Unnamed: 0  ? Summer  01 !  ...  02 !.2  03 !.2  Combined total
0        Afghanistan (AFG)        13     0  ...       0       2               2
1            Algeria (ALG)        12     5  ...       2       8              15
2          Argentina (ARG)        23    18  ...      24      28              70
3            Armenia (ARM)         5     1  ...       2       9              12
4  Australasia (ANZ) [ANZ]         2     3  ...       4       5              12

[5 rows x 16 columns]

### **1.3 Changer le nom des colonnes en utilisant le dictionnaire suivant :**

In [57]:
# Changer le nom des colonnes en utilisant le dictionnaire new_names
new_names =  {'Unnamed: 0': 'Country',
              '? Summer': 'Summer Olympics',
              '01 !': 'Gold',
              '02 !': 'Silver',
              '03 !': 'Bronze',
              '? Winter': 'Winter Olympics',
              '01 !.1': 'Gold.1',
              '02 !.1': 'Silver.1',
              '03 !.1': 'Bronze.1',
              '? Games': '# Games', 
              '01 !.2': 'Gold.2',
              '02 !.2': 'Silver.2',
              '03 !.2': 'Bronze.2'}

olympics_df.rename(columns = new_names, inplace = True)

# Afficher les 5 premières lignes
olympics_df.head()

                   Country  Summer Olympics  ...  Bronze.2  Combined total
0        Afghanistan (AFG)               13  ...         2               2
1            Algeria (ALG)               12  ...         8              15
2          Argentina (ARG)               23  ...        28              70
3            Armenia (ARM)                5  ...         9              12
4  Australasia (ANZ) [ANZ]                2  ...         5              12

[5 rows x 16 columns]